[
    {
        "id": 101,
        "name": "The Well of Dreams and Sorrows",
        "requirements": "Well",
        "setup": "Place a well in the middle of the table. The rest of the table should be crowded with terrain as per a standard game of Frostgrave. Place the central treasure token 6\" away from the well, but equidistant between the starting table edges. Place the other treasure tokens as normal.",
        "treasure": null,
        "experience": [
            {
                "id": 1,
                "type": "checkbox",
                "category": "wizardDrink",
                "description": "If the wizard drinks from the well.",
                "shortDesc": "Wizard drank from well",
                "xpValue": 50,
                "xpLimit": null
            },
            {
                "id": 2,
                "type": "checkbox",
                "category": "apprenticeDrink",
                "description": "If the apprentice drinks from the well.",
                "shortDesc": "Apprentice drank from well",
                "xpValue": 30,
                "xpLimit": null
            }
        ]
    },
    {
        "id": 102,
        "name": "The Mausoleum",
        "requirements": "Mausoleum, skeletons",
        "setup": "Place a square or rectangular building in the centre of the table to represent the mausoleum. The sides of the mausoleum should be around 6” long. Each side of the mausoleum has a door in the middle of the wall (this doesn't need to be depicted on the terrain). This scenario doesn't use a central treasure token. Instead, place four treasure tokens touching the four exterior corners of the building. Each player should then place one additional treasure token on the table anywhere within 9” of the building. Place one skeleton (page 191) in front of each door of the mausoleum and one adjacent to each additional treasure token placed by the players.",
        "treasure": null,
        "experience": []
    },
    {
        "id": 103,
        "name": "The Silent Tower",
        "requirements": "Tower, two small buildings, walkways that can stretch from one to the other.",
        "setup": "Place a ruined tower, at least 10” and three floors high, in the centre of the table. On either side, place two smaller ruined buildings with walkways running from their tops, to either the first or second floor of the tower. The rest of the table should be set up as per a standard game of Frostgrave. The central treasure token should be placed on the very top of the tower. Four more treasure tokens should be placed on the table as per the normal rules. No treasure token that is on or within 6” of the tower can be the target of any spells.",
        "treasure": null,
        "experience": [
            {
                "id": 1,
                "type": "checkbox",
                "category": "wizardTower",
                "description": "+40 experience points if the wizard sets foot inside the tower.",
                "shortDesc": "Wizard entered tower",
                "xpValue": 40,
                "xpLimit": null
            },
            {
                "id": 2,
                "type": "checkbox",
                "category": "apprenticeTower",
                "description": "+20 experience points if the apprentice sets foot inside the tower.",
                "shortDesc": "Apprentice entered tower",
                "xpValue": 20,
                "xpLimit": null
            }
        ]
    },
    {
        "id": 104,
        "name": "The Library",
        "requirements": "None",
        "setup": "The whole table represents the underground library and should be a maze of corridors representing the vast shelves. The shelves are all packed with books, so they block line of sight and movement, but it is possible to climb on and over them. There are several patches of rough ground and obstacles where piles of books and loose papers have frozen into heaps on the floor. Each of the four sides of the table should have a doorway. Warbands must start with all their figures within 6” of the doorway on their side. Place treasure tokens as normal.",
        "experience": []
    },
    {
        "id": 105,
        "name": "The Living Museum",
        "requirements": "Five statues",
        "setup": "In the centre of the table, place four broken walls in a rough 12” square to represent the ruins of the wizard's house. Inside the ruins, place five statues so that they form an 'X' in the centre of the table. Place a treasure token adjacent to each statue, including the central treasure adjacent to the central statue. Fill the rest of the table with terrain as per a standard game.",
        "treasure": null,
        "experience": [
            {
                "id": 1,
                "type": "count",
                "category": "constructsDestroyed",
                "description": "For each medium construct destroyed by a wizard or their warband (this replaces the 5 experience points normally gained for killing an uncontrolled creature).",
                "shortDesc": "Medium Constructs destroyed",
                "xpValue": 10,
                "xpLimit": null
            }
        ]
    },
    {
        "id": 106,
        "name": "The Worm Hunts",
        "requirements": "Giant worm.",
        "setup": "Set up the table as per a standard game of Frostgrave.",
        "treasure": null,
        "experience": [
            {
                "id": 1,
                "type": "checkbox",
                "description": "+20 experience points if the wizard or their warband causes damage to the worm.",
                "xp": 20
            },
            {
                "id": 2,
                "type": "checkbox",
                "description": "+50 experience points if the wizard or their warband kills the worm.",
                "xp": 50
            }
        ]
    },
    {
        "id": 107,
        "name": "The Haunted Houses",
        "requirements": "Five stone huts, ghouls, wraiths.",
        "setup": "Five small stones huts or houses should be placed on the table. One hut should be in the exact centre, the other four should be around 6” away from the centre one. Place the central treasure inside the central hut. Place a normal treasure token in the other four. The rest of the table should be crowded with ruins as per a standard game.",
        "treasure": null,
        "experience": [
            {
                "id": 1,
                "type": "count",
                "description": "+15 experience points for each creature discovered in a hut by the wizard or their warband.",
                "xp": 15
            }
        ]
    },
    {
        "id": 108,
        "name": "The Genie in the Bottle",
        "requirements": "Genie",
        "setup": "The table should be filled with ruins as per a standard game. Place treasure tokens as normal, but the central treasure is treated as a normal treasure token in this scenario.",
        "treasure": null,
        "experience": [
            {
                "id": 1,
                "type": "checkbox",
                "description": "+30 experience points for the wizard whose warband discovers the genie.",
                "xp": 30
            },
            {
                "id": 2,
                "type": "checkbox",
                "description": "+50 experience points if the wizard or their warband kills the genie.",
                "xp": 50
            }
        ]
    },
    {
        "id": 109,
        "name": "The Keep",
        "requirements": "Four arcane discs",
        "setup": "This scenario features four arcane discs, which are flat discs about 2-3” in diameter. These discs should be placed on the table so that they form a cross with opposite discs being about 12” apart. The rest of the table should be crowded with ruins as per a standard game. Place the central treasure in its normal spot, then place one treasure token in the centre of each disc.",
        "treasure": null,
        "experience": [
            {
                "id": 1,
                "type": "checkbox",
                "description": "+30 experience points if the wizard is transported from one disc to another.",
                "xp": 30
            },
            {
                "id": 2,
                "type": "checkbox",
                "description": "+20 experience points if the apprentice is transported from one disc to another.",
                "xp": 20
            }
        ]
    },
    {
        "id": 110,
        "name": "The Complex Temple",
        "requirements": "Six columns.",
        "setup": "Do not place treasure tokens in this scenario. Instead, place six columns in the middle of the table, about 3” apart from each other. The rest of the table should be crowded with terrain as per a standard game.",
        "treasure": null,
        "experience": [
            {
                "id": 1,
                "type": "checkbox",
                "description": "+30 experience points if the wizard fights a column.",
                "xp": 30
            },
            {
                "id": 2,
                "type": "checkbox",
                "description": "+20 experience points if the apprentice fights a column.",
                "xp": 20
            }
        ]
    }

]